FemDesign.Bars.Buckling.Position
segmentposition_type

FemDesign.Bars.Buckling.Position.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.Buckling.Position.AlongBar
Create a definition of buckling length along the full length of the bar.
Remarks: Private
Returns:

FemDesign.Bars.Buckling.Position.ByParameters(System.Double,System.Double)
Create a definition of buckling length along the bar. Start and end by parameter.
Remarks: Private
startParameter: Start of buckling length. Value equal to or between 0 and 1. 0 = start of bar, 1 = end of bar.
endParameter: End of buckling length. Value equal to or between 0 and 1. 0 = start of bar, 1 = end of bar